## Final Project Submission

Please fill out:
* Student name: Benjamin Toler
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [2]:
#import all necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
#import data
df1 = pd.read_csv('zippedData/bom.movie_gross.csv.gz')
df2 = pd.read_csv('zippedData/imdb.name.basics.csv.gz')
df3 = pd.read_csv('zippedData/imdb.title.akas.csv.gz')
df4 = pd.read_csv('zippedData/imdb.title.basics.csv.gz')
df5 = pd.read_csv('zippedData/imdb.title.crew.csv.gz')
df6 = pd.read_csv('zippedData/imdb.title.principals.csv.gz')
df7 = pd.read_csv('zippedData/imdb.title.ratings.csv.gz')
df8 = pd.read_csv('zippedData/rt.movie_info.tsv.gz', delimiter='\t')
df9 = pd.read_csv('zippedData/rt.reviews.tsv.gz', sep='\t', 
                  encoding= 'unicode_escape')
df10 = pd.read_csv('zippedData/tmdb.movies.csv.gz', index_col=0)
df11 = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')
dfs = [df1, df2, df3, df4, df5, df6, df7, df8, df9, df10, df11]

# Data Exploration

In [4]:
#preview datasets
for index in range(len(dfs)):
    print("df",index+1)
    display(dfs[index].head(2))

df 1

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

df 2

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"

df 3

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0

df 4

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

df 5

      tconst  directors              writers
0  tt0285252  nm0899854            nm0899854
1  tt0438973        NaN  nm0175726,nm1802864

df 6

      tconst  ordering     nconst  category  job   characters
0  tt0111414         1  nm0246005     actor  NaN  ["The Man"]
1  tt0111414         2  nm0398271  director  NaN          NaN

df 7

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559

df 8

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One

df 9

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"

df 10

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

df 11

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

We will combine datasets 2, 3, 4, 5, 7 from IMBD and select for areas of interests
including genre, runtime, rating, and director

In [5]:
df3.head(5)

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

As Mirosoft is an American company it makes sense to explore only movies made
in the US, as these will give the most accurate expectations for Microsoft. Additionally, by examining df3, we see that many of the title_ids are repeated. We only need one instance of each movie for analysis so we will remove these duplicates. Lastly we will select only the title_id and title from the dataset.

In [6]:
#select only US films
df3 = df3[df3.region == 'US']
#check that we only have US films
df3.region.unique()

array(['US'], dtype=object)

In [7]:
df3.drop_duplicates(subset='title_id', inplace=True)

<ipython-input-7-9609a98a78bf>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop_duplicates(subset='title_id', inplace=True)

In [8]:
df3 = df3[['title_id', 'title']]

In [9]:
#check if the previous code worked
print(max(df3.title_id.value_counts()))
df3.head(5)

1

       title_id                                       title
12    tt0369610                           Jurassic World 3D
50    tt0401729                         John Carter of Mars
109   tt1014759  Alice in Wonderland: An IMAX 3D Experience
152  tt10379338                              Guys Night Out
157  tt10446418                                    The Icon

Now that we have the date we want from df3 will join datsets 3 and 4 using the common title_id/tconst. Furthermore we are only interested in joining runtime and genres from df4.

In [10]:
#reset index of df4 to tconst
df4.set_index('tconst', inplace=True)

In [11]:
#join df3 with df4
df3_4 = df3.join(df4[['start_year', 'runtime_minutes', 'genres']], how='inner', on='title_id')
print(df3_4.shape)
df3_4.head()

(47433, 5)

,title_id,title,start_year,runtime_minutes,genres
12,tt0369610,Jurassic World 3D,2015,124.0,"Action,Adventure,Sci-Fi"
50,tt0401729,John Carter of Mars,2012,132.0,"Action,Adventure,Sci-Fi"
109,tt1014759,Alice in Wonderland: An IMAX 3D Experience,2010,108.0,"Adventure,Family,Fantasy"
152,tt10379338,Guys Night Out,2019,NaN,Comedy
157,tt10446418,The Icon,2011,215.0,"Documentary,History"

Now we will join df 7 to our joined df3_4, again using tconst

In [12]:
df7.set_index('tconst', inplace=True)

In [13]:
df3_4_7 = df3_4.join(df7, how='left', on='title_id')
print(df3_4_7.shape)
df3_4_7.head(5)

(47433, 7)

,title_id,title,start_year,runtime_minutes,genres,averagerating,numvotes
12,tt0369610,Jurassic World 3D,2015,124.0,"Action,Adventure,Sci-Fi",7.0,539338.0
50,tt0401729,John Carter of Mars,2012,132.0,"Action,Adventure,Sci-Fi",6.6,241792.0
109,tt1014759,Alice in Wonderland: An IMAX 3D Experience,2010,108.0,"Adventure,Family,Fantasy",6.5,358813.0
152,tt10379338,Guys Night Out,2019,NaN,Comedy,NaN,NaN
157,tt10446418,The Icon,2011,215.0,"Documentary,History",NaN,NaN

Next we join the directors column from df5

In [14]:
df5.set_index('tconst', inplace=True)

In [15]:
df3_4_7_5 = df3_4_7.join(df5['directors'], how='left', on='title_id')
print(df3_4_7_5.shape)
df3_4_7_5.head(5)

(47433, 8)

,title_id,title,start_year,runtime_minutes,genres,averagerating,numvotes,directors
12,tt0369610,Jurassic World 3D,2015,124.0,"Action,Adventure,Sci-Fi",7.0,539338.0,nm1119880
50,tt0401729,John Carter of Mars,2012,132.0,"Action,Adventure,Sci-Fi",6.6,241792.0,nm0004056
109,tt1014759,Alice in Wonderland: An IMAX 3D Experience,2010,108.0,"Adventure,Family,Fantasy",6.5,358813.0,nm0000318
152,tt10379338,Guys Night Out,2019,NaN,Comedy,NaN,NaN,nm2584377
157,tt10446418,The Icon,2011,215.0,"Documentary,History",NaN,NaN,nm4270970

We need to replace the person_ids in the directors column with their actual names, so we will join this dataset with df2 using the nconst and directors as a common link. We only need primary name form df2

In [16]:
df2.set_index('nconst', inplace=True)

In [17]:
imbd_df = df3_4_7_5.join(df2['primary_name'], how='left', on='directors')
# we can then drop the director id column, and change the primary_name column
# to director
imbd_df.drop('directors', axis=1, inplace=True)
imbd_df.rename(columns={'primary_name': 'director'}, inplace=True)
print(imbd_df.shape)
imbd_df.head(5)

(47433, 8)

,title_id,title,start_year,runtime_minutes,genres,averagerating,numvotes,director
12,tt0369610,Jurassic World 3D,2015,124.0,"Action,Adventure,Sci-Fi",7.0,539338.0,Colin Trevorrow
50,tt0401729,John Carter of Mars,2012,132.0,"Action,Adventure,Sci-Fi",6.6,241792.0,Andrew Stanton
109,tt1014759,Alice in Wonderland: An IMAX 3D Experience,2010,108.0,"Adventure,Family,Fantasy",6.5,358813.0,Tim Burton
152,tt10379338,Guys Night Out,2019,NaN,Comedy,NaN,NaN,Arthur Muhammad
157,tt10446418,The Icon,2011,215.0,"Documentary,History",NaN,NaN,Nenad Ilic

Now we will join the imbd_df with df1 which includes data about how much the movie makes

In [18]:
df1.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [19]:
movie_df = imbd_df.merge(df1, how='inner', left_on=['title', 'start_year'],
                        right_on=['title', 'year'])
movie_df.drop(['studio', 'start_year'], axis=1, inplace=True)

In [20]:
movie_df

,title_id,title,runtime_minutes,genres,averagerating,numvotes,director,domestic_gross,foreign_gross,year
0,tt1223236,African Cats,89.0,"Adventure,Documentary",7.6,5784.0,NaN,15400000.0,15400000,2011
1,tt1235522,Broken City,109.0,"Crime,Drama,Thriller",6.2,71704.0,Allen Hughes,19700000.0,NaN,2013
2,tt1343727,Dredd,95.0,"Action,Crime,Sci-Fi",7.1,234616.0,Pete Travis,13400000.0,22200000,2012
3,tt1401152,Unknown,113.0,"Action,Mystery,Thriller",6.9,235167.0,Jaume Collet-Serra,63700000.0,67099999,2011
4,tt1413496,Revenge of the Electric Car,90.0,Documentary,7.2,1692.0,Chris Paine,151000.0,NaN,2011
...,...,...,...,...,...,...,...,...,...,...
995,tt8108198,Andhadhun,139.0,"Crime,Thriller",8.5,43409.0,Sriram Raghavan,1200000.0,NaN,2018
996,tt3348730,Jigsaw,92.0,"Crime,Horror,Mystery",5.8,57184.0,NaN,38100000.0,64900000,2017
997,tt4651520,Bad Moms,100.0,Comedy,6.2,100952.0,NaN,113300000.0,70700000,2016
998,tt5462602,The Big Sick,120.0,"Comedy,Drama,Romance",7.6,104008.0,Michael Showalter,42900000.0,13500000,2017
999,tt6370266,Bending the Arc,102.0,Documentary,8.1,93.0,NaN,21900.0,NaN,2017

In [21]:
df11['year'] = df11.release_date.map(lambda x: int(x[-4:]))
df11['month'] = df11.release_date.map(lambda x: x[:3])

In [22]:
df11

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year,month
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009,Dec
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,May
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,Jun
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015,May
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017,Dec
...,...,...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0,2018,Dec
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495",1999,Apr
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338",2005,Jul
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0,2015,Sep
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041",2005,Aug

In [23]:
movie2_df = imbd_df.merge(df11, how='inner', left_on=['title', 'start_year'],
                        right_on=['movie', 'year'])

In [24]:
movie2_df

,title_id,title,start_year,runtime_minutes,genres,averagerating,numvotes,director,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year,month
0,tt1235522,Broken City,2013,109.0,"Crime,Drama,Thriller",6.2,71704.0,Allen Hughes,11,"Jan 18, 2013",Broken City,"$35,000,000","$19,701,164","$34,480,045",2013,Jan
1,tt1343092,The Great Gatsby,2013,143.0,"Drama,Romance",7.3,433165.0,Baz Luhrmann,70,"May 10, 2013",The Great Gatsby,"$190,000,000","$144,840,419","$351,040,419",2013,May
2,tt1343727,Dredd,2012,95.0,"Action,Crime,Sci-Fi",7.1,234616.0,Pete Travis,15,"Sep 21, 2012",Dredd,"$45,000,000","$13,414,714","$41,467,606",2012,Sep
3,tt1401152,Unknown,2011,113.0,"Action,Mystery,Thriller",6.9,235167.0,Jaume Collet-Serra,21,"Feb 18, 2011",Unknown,"$40,000,000","$63,686,397","$136,123,083",2011,Feb
4,tt1604171,Prom,2011,104.0,"Comedy,Drama,Family",5.4,14279.0,Joe Nussbaum,97,"Apr 29, 2011",Prom,"$8,000,000","$10,130,219","$10,763,183",2011,Apr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1006,tt3348730,Jigsaw,2017,92.0,"Crime,Horror,Mystery",5.8,57184.0,NaN,61,"Oct 27, 2017",Jigsaw,"$10,000,000","$38,052,832","$102,445,196",2017,Oct
1007,tt4651520,Bad Moms,2016,100.0,Comedy,6.2,100952.0,NaN,99,"Jul 29, 2016",Bad Moms,"$20,000,000","$113,257,297","$180,998,716",2016,Jul
1008,tt5442430,Life,2017,104.0,"Horror,Sci-Fi,Thriller",6.6,182840.0,Daniel Espinosa,66,"Mar 24, 2017",Life,"$58,000,000","$30,234,022","$100,929,666",2017,Mar
1009,tt5462602,The Big Sick,2017,120.0,"Comedy,Drama,Romance",7.6,104008.0,Michael Showalter,64,"Jun 23, 2017",The Big Sick,"$5,000,000","$42,872,467","$53,972,860",2017,Jun
1010,tt6139732,Aladdin,2019,128.0,"Adventure,Comedy,Family",7.4,57549.0,Guy Ritchie,81,"May 24, 2019",Aladdin,"$182,000,000","$246,734,314","$619,234,314",2019,May

In [25]:
total_df = pd.concat([movie_df, movie2_df])

In [26]:
total_df.drop_duplicates('title', keep='last', inplace=True)

In [27]:
total_df.shape

(1315, 17)

In [28]:
total_df

,title_id,title,runtime_minutes,genres,averagerating,numvotes,director,domestic_gross,foreign_gross,year,start_year,id,release_date,movie,production_budget,worldwide_gross,month
0,tt1223236,African Cats,89.0,"Adventure,Documentary",7.6,5784.0,NaN,1.54e+07,15400000,2011,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,tt1413496,Revenge of the Electric Car,90.0,Documentary,7.2,1692.0,Chris Paine,151000,NaN,2011,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,tt1837709,Winter's Tale,118.0,"Drama,Fantasy,Mystery",6.2,49077.0,Akiva Goldsman,1.26e+07,18500000,2014,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,tt1185416,When in Rome,91.0,"Comedy,Romance",5.6,57396.0,Mark Steven Johnson,3.27e+07,10400000,2010,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,tt1426329,Lovelace,93.0,"Biography,Drama",6.2,35957.0,NaN,357000,1200000,2013,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1006,tt3348730,Jigsaw,92.0,"Crime,Horror,Mystery",5.8,57184.0,NaN,"$38,052,832",NaN,2017,2017.0,61.0,"Oct 27, 2017",Jigsaw,"$10,000,000","$102,445,196",Oct
1007,tt4651520,Bad Moms,100.0,Comedy,6.2,100952.0,NaN,"$113,257,297",NaN,2016,2016.0,99.0,"Jul 29, 2016",Bad Moms,"$20,000,000","$180,998,716",Jul
1008,tt5442430,Life,104.0,"Horror,Sci-Fi,Thriller",6.6,182840.0,Daniel Espinosa,"$30,234,022",NaN,2017,2017.0,66.0,"Mar 24, 2017",Life,"$58,000,000","$100,929,666",Mar
1009,tt5462602,The Big Sick,120.0,"Comedy,Drama,Romance",7.6,104008.0,Michael Showalter,"$42,872,467",NaN,2017,2017.0,64.0,"Jun 23, 2017",The Big Sick,"$5,000,000","$53,972,860",Jun
1010,tt6139732,Aladdin,128.0,"Adventure,Comedy,Family",7.4,57549.0,Guy Ritchie,"$246,734,314",NaN,2019,2019.0,81.0,"May 24, 2019",Aladdin,"$182,000,000","$619,234,314",May

In [29]:
total_df.shape

(1315, 17)